# -*- coding: utf-8 -*-
from konlpy.tag import Twitter
from bs4 import BeautifulSoup
import time, re, csv, requests
start_time = time.time()

def onlytext(string):
    string = string.replace('<div align="center">', ' / ')
    string = string.replace('<br/>', ' / ')
    string = string.replace('<br>', ' / ')
    string = string.replace('<p>', ' / ')
    string = string.replace('</p>', ' / ')
    string = string.replace('&gt;', ' / ')
    string = string.replace('&lt;', ' / ')

    length = len(string)
    tagend = 0
    count = 0
    flag = 0
    if '<' in string:
        output = ''
        for i in range(length):

            if tagend == 1 and string[i] == "<":
                output = output + string[flag:flag + count]
                tagend = 0

            elif tagend == 1 and i + 1 == length:
                output = output + string[flag:flag + count + 1]
                tagend = 0

            elif string[i] == ">":
                flag = i + 1
                count = 0
                tagend = 1

            elif string[i] != "<":
                count += 1
    else:
        output = string

    output = output.replace('[', ' ')
    output = output.replace(']', ' ')
    output = output.replace('\ufeff;', ' ')
    output = output.replace('\u200b', ' ')
    output = output.replace('&nbsp;', ' ')
    output = output.replace('\xa0', ' ')
    output = output.replace("\t", " / ")
    output = output.replace("\n", " / ")
    output = output.replace("\r", " / ")
    return output
def possible_restname(restname):
    if ' ' in restname:
        temp = restname.split(' ')
        for t in temp:
            for place in places:
                if place in t and t in temp and t[-1] == '점':
                    temp[temp.index(t)] = ''
                    # break

        restname = temp
    else:
        for place in places:
            if place in restname and '점' in restname:
                restname = restname.replace(place, ' ')
                restname = restname.replace('점', ' ')
        restname = restname.split(' ')
    temp2 = []
    for r in restname:
        if r and len(r) > 1:
            temp2.append(r)
    return temp2
def tokenize(nlp, data, places):

    #--------- 토큰화한 정보를 파이썬 파일로 저장함  (분석 파일에서 불러다 쓰기 위함 )-------------
    #w = open('Training_sample_1.py', 'w', encoding='utf-8')
    w = open('Tokenized_data.py', 'w', encoding='utf-8')
    w.write("resultlist=( (0,0) ")  # training 데이터 저장
    #w2 = open('Test_sample_1.py', 'w', encoding='utf-8')
    #w2.write("resultlist=( (0,0) ")
    #w3 = open('train_extra6.py', 'w', encoding='utf-8')
    #w3.write("resultlist=[ 0")
    #w4 = open('test_extra6.py', 'w', encoding='utf-8')
    #w4.write("resultlist=[ 0
    flag = 0 # Train / Test 나누기 용
    regex = r'[가-힣, a-z, 0-9]+'

    # -------- row 별로 품사 태깅 및 상호명, 지역명 등 추측 -----
    for row in data:
        # 진리값
        if row[0] == '\ufefffake' or row[0] == 'fake':
            type = '0'
        elif row[0] == 'real':
            type = '1'

        # --------품사분류 및 태깅---------
        row3 = row[3]  # 본문내용
        restname = row[6]  # 상호명
        pos = nlp.pos(row3, norm=True, stem=True)
        templist = []
        for word in pos:
            vocab = word[0]
            POS = word[1]
            if vocab != '\xa0' and vocab != '/' and POS != 'Alpha' and POS != 'Number':
                string = ''
                string += vocab + word[1][0] + word[1][-1]
                templist.append(string)

        # -----전화번호 출현 빈도 추측---
        phone = 0
        for number in ('연락처Nn', '전번Nn', '전화Nn', '전화번호Nn'):
            phone += templist.count(number)

        # -------상호명 출현 빈도 추측 restname이 없을 때는 글제목과 본문내용 참조함.------
        max2 = 0
        restname = (restname.replace('/', ''))
        restname = (restname.replace('(', ' '))
        restname = (restname.replace(')', ' '))
        restname = (restname.replace(',', ' '))
        restname = restname.replace('&amp;', ' ').strip()  # 상호명
        if restname:  # 정보 있음
            temp = restname.split(' ')
            isPlacename = 0
            # 주소인지 상호명인지 판별
            for place in places:
                if place in temp[0]:
                    isPlacename = 1
                    break
            # 주소라고 판단
            if isPlacename and restname[-1] in ('0', '1', '2', '3', '4', '5', '6', '7', '8', '9'):  # or '상가' in restname):
                url2 = 'https://search.naver.com/search.naver?sm=tab_sug.top&where=nexearch&query=' + restname
                source_code = requests.get(url2)
                soup = BeautifulSoup(source_code.text, "lxml")
                a = str(soup.find_all('dd', class_='vicinity'))
                a = onlytext(a)
                if '더보기' in a:
                    a = a.replace('더보기', '')
                a = a.split(', ')

                temp3 = []
                for info in a:
                    info = info.strip()
                    temp2 = possible_restname(info)
                    for k in temp2:
                        temp3.append(k)

                if temp3:
                    for element in temp3:
                        c = row3.count(element)
                        if max2 < c:
                            max2 = c
                            # final = element
                            # print(final)


                else:
                    a = ''
                    for i in row[2]:
                        if re.fullmatch(regex, i):
                            a += re.fullmatch(regex, i)[0]
                        else:
                            a += ' '
                    a = a.split(' ')
                    for element in a:
                        c = row3.count(element)
                        if max2 < c:
                            max2 = c
            # 상호명이라고 판단
            else:

                for element in possible_restname(restname):
                    c = row3.count(element)
                    if max2 < c:
                        max2 = c
                        # final = element
                        # print(final)
        else:  # 정보 없음 제목참고
            title = ''
            for i in row[2]:
                if re.fullmatch(regex, i):
                    title += re.fullmatch(regex, i)[0]
                else:
                    title += ' '

            title = title.split(' ')

            for index in range(len(title)):  # 맛집구 제거, 지역
                candidate = title[index]
                if '맛집' in candidate or len(candidate) == 1:  # 맛집이라는 스트링이 포함된 구 제거
                    title[index] = ''
                for P in places:
                    if P in candidate:  # 지역이름이 포함된 구 제거
                        title[index] = ''
                if candidate[-2:] == '에서':  # ~에서 일 때 에서 제거
                    title[index] = candidate[:-2]

                elif len(title[index]) > 2:  # 상호명에 조사가 붙을 경우를 대비해 글자가 3개 이상일 시 멘 마지막글자 제거
                    title[index] = candidate[:-1]

            title2 = []
            for t in title:
                if t:
                    title2.append(t)
            for element in title2:
                c = row3.count(element)
                if max2 < c:
                    max2 = c
                    # final = element
                    # print(final)

        # --------지역명 출현 빈도 추측-----
        max = 0
        for placename in places:
            city = row3.count(placename)
            if max < city:
                max = city


        # ------진리값과 함께 데이터를 튜플로 묶기-------
        # templist.append() # 감정변수  추가해야함
        templist.append(phone) #전화번호 수
        templist.append( int(row[4]) ) # 사진 수
        templist.append( int(row[5]) ) # 이모티콘 수
        templist.append(max2) # 상호명 수
        templist.append(max) # 지역명 수

        temptu = (templist, type)

        w.write(',')
        w.write(str(temptu))
        '''# -------train:test = 4 : 1 나누기--------
        if flag % 5 == 0:       # test
            w2.write(',')
            w2.write(str(temptu))
        else:                   # train
            w.write(',')
            w.write(str(temptu))
        flag += 1
        '''


    w.write(")")
    w.close()
    #w2.write(")")
    #w2.close()
    return


nlp = Twitter()  # Twitter 라이브러리 사용
data_ = csv.reader(open("reviews_rawdata_4.txt", 'r', encoding='utf-8'), delimiter='\t')
# 2385+개 지역
places = ('전남', '전북', '금성', '출장소', '월배', '하상', '신곡', '태전', '대학로', '청파', '개정', '망경', '이호', '원덕', '신봉', '강매', '삽교', '병곡', '영랑',
'도평', '곤명', '궁내', '목천', '기계', '소룡', '중랑', '공근', '상장', '세곡', '여의도', '시민공원', '모서', '북이', '중면', '의홍', '상사', '금구', '군북',
'산성', '인천시청', '우천', '상대', '하점', '양재', '홍대', '원주', '선단', '신선', '부항', '동대', '서부여성회관', '부천종합운동장', '이산', '잠실본', '백산', '옥성',
'부동', '발곡', '덕계', '몽탄', '용덕', '마령', '광명사거리', '모란', '서동탄', '남선', '장유', '용지', '원곡본', '사남', '부개', '보라매', '구림', '온양온천',
'지동', '담양', '청산', '한산', '영해', '계성', '익산', '세류', '비인', '내속리', '줄포', '마곡나루', '여항', '을지로', '오성', '석교', '낙월', '백사', '북하',
'수동', '묵호', '현남', '무정', '무을', '강하', '어린이대공원', '금산', '은하', '화산', '광산', '선바위', '이대', '근화', '청도', '신연수', '행주', '쌍책', '덕곡',
'이태원', '관인', '단원', '대치', '인월', '죽전', '용평', '군포', '백곡', '월산', '북신', '범골', '내수', '지례', '영화', '감천', '상왕십리', '관산', '문척',
'천연', '포두', '백석', '남구로', '모래내시장', '염리', '지석', '성송', '만수', '점동', '역촌', '칠금', '대조', '칠북', '현서', '산포', '금지', '난곡', '인화',
'청북', '퇴계', '미로', '수유', '양산', '도양', '부평구청', '청룡', '옹진', '수원시청', '영광', '청리', '직산', '남춘천', '낙성대', '의령', '자양', '대강', '용인',
'대부', '신대방', '후암', '심원', '간동', '한강진', '엄사', '농소', '유림', '풍무', '상봉', '장산', '수리산', '칠암', '경포', '발산', '봉화산', '장승배기', '노안',
'양원', '대방', '흥덕', '두서', '현내', '덕적', '천가', '고촌', '회천', '동화', '중촌', '삼문', '내촌', '내방', '오부', '대교', '병영', '금일', '목상', '개화산',
'산외', '야당', '비봉', '옥동', '내산', '명지', '북정', '갈현', '여의나루', '고부', '정동', '상운', '약수', '경주', '금남', '뚝섬유원지', '구룡', '동성', '이촌',
'덕천', '해제', '월성', '반송', '위천', '매곡', '지곡', '제기', '진례', '단장', '숭실대', '봉남', '신수', '정산', '용봉', '충무로', '청원', '단월', '연일',
'중부', '양양', '상일', '면목본', '칠보', '지현', '만덕', '검단오류', '주교', '용방', '도산', '정우', '태백', '개천', '인계', '송중', '국우', '진주', '면',
'괴정', '고성', '단구', '공항', '천마산', '마암', '청남', '현덕', '임고', '백전', '황전', '학여울', '고등', '입면', '학운', '망포', '해평', '신갈', '망성',
'삼덕', '화양', '연성', '이안', '역곡', '방림', '인창', '이창', '충장', '귀인', '선두구', '죽왕', '영강', '건입', '가조', '송하', '근북', '대송', '조양',
'굴봉산', '황남', '철산', '시청·용인대', '현풍', '영암', '칠산서부', '사상', '독산', '창수', '이동', '춘의', '사가정', '청소', '부여', '완정', '단계', '신내',
'논공', '삼도', '해룡', '한경', '연곡', '강일', '녹전', '개봉', '하성', '초장', '성남', '문정', '강남구청', '신광', '여수', '논산', '신지', '아신', '완주',
'토지', '진관', '춘천', '귀래', '동대문역사문화공원', '악양', '효동', '진보', '성포', '일운', '서울대', '춘산', '임계', '서후', '청룡노포', '철원', '신천', '효창공원앞',
'율촌', '거창', '마도', '상면', '운암', '봉현', '남사', '종로5가', '송산', '각남', '용답', '진량', '불은', '송학', '소공', '보절', '와룡', '마산회원', '괘법',
'마석', '다인', '군남', '궁유', '충무', '북항', '득량', '금서', '소초', '강북', '동막', '공성', '의신', '유어', '칠곡', '인수', '화현', '대천', '대서', '부림',
'창원', '파동', '연제', '무태조야', '중계', '수북', '홍제', '평촌', '하이', '명학', '해안', '인천', '한성대', '북도', '고제', '명동', '동문', '계룡', '영춘',
'지금', '성당', '건천', '도량', '금광', '김제', '남상', '창녕', '왕십리', '대신', '무전', '새말', '봉화', '양평', '정천', '수락산', '문광', '흥도', '영인',
'상천', '적량', '신평', '유가', '다운', '반곡관설', '장항', '옥곡', '신의', '대지', '굴포천', '광정', '대야', '분당', '신도', '와촌', '운수', '경산', '충청남',
'지천', '단산', '현동', '원북', '통복', '명석', '병암', '향교', '팽성', '김포', '서정', '미아', '신안', '비산', '화동', '주문진', '모가', '삼서', '신풍', '용산',
'활천', '신원', '진동', '온수', '매화', '서신', '매교', '화곡본', '옥계', '연산', '화성', '서호', '강상', '진원', '노암', '부민', '의왕', '규암', '심곡본',
'별량', '장동', '본동', '원산', '세마', '신흥', '진천', '마북', '반남', '율목', '청명', '웅진', '대곡', '부평삼거리', '남제', '남종', '을지로3가', '단대오거리',
'연안', '광운대', '내곡', '황등', '평은', '남천', '현북', '이서', '교동', '선암', '양사', '임천', '입장', '대곶', '봉동', '삼청', '서정리', '왕산', '입북',
'홍산', '암사', '범전', '장암', '봉암', '강내', '병천', '신촌', '신인', '올림픽공원', '예례', '평화남산', '청하', '종로3가', '능주', '용전', '한천', '제물포',
'보덕', '덕양', '송파', '일신', '오목교', '소흘', '신니', '광탄', '현산', '낙안', '숙대', '칠량', '개화', '철암', '금성', '정선', '주덕', '산인', '신탄진',
'신이문', '동래', '봉평', '중학', '추풍령', '중화', '대성리', '하동', '대륜', '합천', '북일', '도천', '무주', '두촌', '하북', '동부', '초동', '부안', '경천',
'장한평', '언양', '구룡포', '장계', '회성', '송월', '도포', '홍북', '삼일', '유치', '무실', '해도', '영산', '나주', '아미', '두마', '삼산', '금사', '순성',
'초당', '중앙', '주안', '팔봉', '하일', '양감', '암태', '길안', '신덕', '석계', '상북', '자은', '계곡', '양정', '잠실새내', '은척', '경기', '옥포', '장연',
'적상', '해남', '이평', '별양', '문성', '퇴촌', '봉림', '현경', '성환', '미양', '불갑', '명호', '보안', '창신', '진건', '식사', '죽교', '방학', '지제', '진미',
'엄다', '수지구청', '고한', '광진', '약산', '호평', '정자', '수한', '조도', '인하대', '동천', '동곡', '수송', '생비량', '기성', '강동구청', '호법', '일곡', '미평',
'의정부', '언주', '테스트', '양서', '수리', '고산', '남한산성', '어룡', '광덕', '안남', '사매', '보길', '도두', '호암', '신성', '읍내', '감물', '금천', '운길산',
'대정', '석동', '유달', '수완', '한수', '점곡', '수궁', '검단', '함열', '왕궁', '상패', '영순', '양강', '송정', '하의', '인천터미널', '노산', '평안', '일산동',
'동상', '대포', '고잔', '일반성', '진전', '문의', '옥도', '변동', '영종', '유곡', '경기광주', '석곡', '선장', '월항', '도사', '강변', '수주', '순창', '복수',
'향동', '광활', '금수', '주촌', '유덕', '중마', '안천', '남현', '남해', '황오', '원흥', '정읍', '구운', '퇴계원', '부북', '삼성중앙', '성주', '일직', '지수',
'광장', '안암', '강진', '암남', '청일', '석촌', '장수', '상암', '무풍', '오천', '장호원', '비안', '밀양', '창평', '청량', '구암', '안사', '외산', '증미', '사천',
'교방', '강외', '증평', '오금', '도안', '상봉서', '대공원', '명곡', '황지', '풍암', '삼수', '운주', '신둔', '괴산', '상교', '주천', '단양', '삼남', '천안',
'원평', '청라', '여천', '칠서', '해보', '남성', '소안', '서북', '양지', '매전', '대촌', '설성', '불암', '봉황', '죽곡', '디지털미디어시티', '구일', '동인천', '도초',
'지축', '변산', '아주', '수진', '약사명', '보정', '남부', '사벌', '조치원', '대흥', '아차산', '둔포', '남원', '근덕', '영천', '안강', '남촌도림', '한티', '이월',
'송지', '약목', '단북', '안면', '중리', '한려', '흥선', '노량진', '신둔도예촌', '가천대', '광천', '정곡', '오포', '백암', '세교', '덕연', '사곡', '추부', '상중이',
'임피', '동향', '사근', '하양', '신동', '북상', '팔당', '초월', '과천', '한림', '남동구청', '과역', '민락', '범박', '관교', '당고개', '모동', '부량', '역삼',
'평화', '상도', '율곡', '수양', '북성', '영등포', '삼평', '공도', '양화', '운중', '용주', '예안', '부적', '우암', '통영', '주생', '삼호', '죽도', '미금', '화촌',
'봉명', '가회', '주삼', '진해', '가북', '횡천', '신길', '죽장', '옥종', '향촌', '이현', '불현', '봉양', '교동월촌', '인주', '우정', '양구', '송동', '남부터미널',
'압구정', '관문', '미성', '풍덕', '샛강', '교대', '군위', '호수', '옥암', '장천', '우강', '서수', '마포', '주산', '용면', '상평', '백마', '문산', '마동', '쌍백',
'이인', '신용산', '청성', '수내', '서구청', '금학', '장마', '삼학', '영월', '도촌', '어모', '가덕', '약대', '동서금', '선남', '금곡', '인천대', '상월곡', '선도',
'불국', '서포', '덕소', '화랑대', '신북', '두산', '내면', '북삼', '방이', '세종대왕릉', '제천', '가좌', '구천', '도림', '기린', '김천', '나산', '장기', '남양',
'강구', '동두천중앙', '포승', '상록수', '가산', '영운', '동서학', '연초', '안계', '법전', '노동', '동구', '합정', '평내호평', '거류', '휴천', '지사', '화전', '욕지',
'청풍', '중구', '신정네거리', '백양리', '조촌', '포항', '건국', '남동인더스파크', '성북', '전라북', '노원', '노들', '현곡', '울릉', '가남', '종천', '길곡', '교남',
'충주', '옥룡', '평거', '발한', '석관', '하남', '구이', '광화문', '신답', '신방화', '애오개', '손불', '성현', '파천', '운곡', '문곡소도', '기산', '덕과', '영남',
'풍호', '대동', '유성', '포천', '속초', '운남', '탄방', '부용', '거제', '효덕', '삼양', '고대', '고암', '채운', '다시', '감포', '벌곡', '법성', '마두',
'소래포구', '안성', '서삼', '관악', '우산', '북부', '신방', '입암', '율면', '달산', '어상천', '정왕', '남이', '잠실', '둔덕', '대덕', '용궁', '상갈', '양촌',
'면부', '녹천', '곤양', '양금', '정관', '구즉', '진영', '중림', '국수', '용안', '방화', '은평', '신도림', '울산', '신논현', '우이', '태인', '다산', '신중동',
'안평', '사하구', '동홍', '인지', '왕십리도선', '영도', '어양', '도심', '석천사거리', '영덕', '선릉', '가산디지털단지', '금마', '경기도청북부청사', '중계본', '예술회관',
'염창', '서석', '축동', '필동', '성곡', '김화', '안좌', '용상', '태장', '회북', '서창', '신사우', '삼각산', '문내', '세도', '마리', '성동', '동계', '남면',
'고로', '연기', '부계', '이반성', '농암', '서천', '운정', '전민', '여좌', '옥천', '원인재', '압량', '도원', '삼례', '상전', '청안', '신목동', '문학', '은행',
'의창', '작천', '성호', '용성', '이방', '정왕본', '배방', '봉래', '나포', '전동', '부원', '성전', '신사', '청량리', '독정', '회현', '화정', '송촌', '고금',
'대술', '사내', '가정중앙시장', '묘산', '광혜원', '선유도', '해리', '오수', '남항', '부창', '청림', '동선', '마성', '병점', '가락', '사창', '연남', '경복궁', '풍각',
'모충', '정량', '도계', '쌍용', '마서', '단대', '저전', '하면', '서종', '조곡', '남지', '내가', '북아현', '김해', '대보', '부론', '용유', '팔룡', '팔복',
'의정부시청', '해미', '문막', '월명', '광교', '옥수', '고창', '개포', '망월사', '일월', '조성', '요촌', '범계', '장곡', '동서', '정부과천청사', '동호', '도봉산',
'성수', '공덕', '영통', '동로', '서생', '상관', '간석오거리', '점암', '경전철의정부', '거진', '부산진', '안중', '왕정', '용진', '강림', '고천', '산본', '갑천',
'노성', '방배', '청주', '동수', '방산', '온정', '지식정보단지', '월롱', '삼성', '수비', '북내', '목행', '신가', '학성', '미천', '판문', '사직', '수륜', '광나루',
'곡선', '이로', '임하', '용마산', '낭성', '별내', '맹동', '우보', '안흥', '용화', '비래', '왕길', '강원', '캠퍼스타운', '망상', '산북', '장수서창', '청호',
'검단사거리', '수색', '살미', '망원', '운동장·송담대', '구평', '청운', '공검', '서대문', '부평', '삼랑진', '노화', '흥업', '미력', '홍천', '연무', '동명', '소요',
'신정', '풍산', '태릉', '용문', '불광', '일원', '활성', '강현', '판교', '장량', '초계', '탄부', '답십리', '관음', '송탄', '노학', '마량', '오류', '길동', '도당',
'교하', '성연', '지보', '기장', '영중', '흥남', '사우', '용동', '축산', '청라국제도시', '서화', '개포동', '서강', '구항', '상문', '승주', '낙서', '대성', '지도',
'한강로', '복산', '야로', '여서', '행구', '웅포', '남동', '녹산', '두호', '울주', '광양', '원천', '고양', '금당', '선정릉', '오산', '월야', '고현', '반포본',
'서원', '산남', '평내', '원미', '학산', '연수', '가평', '선학', '아영', '동내', '강동', '을지로4가', '효문', '비아', '영북', '상월', '백학', '덕암', '생극',
'대모산', '임곡', '길음', '주암', '군자', '조마', '대호지', '파평', '안덕', '김포공항', '고흥', '구리', '문원', '행안', '간석', '광림', '오동', '황연', '팔탄',
'토성', '서교', '월곶', '먹골', '금동', '문래', '탄현', '월영', '서면', '월계', '임자', '수곡', '옥산', '고경', '칠성', '연동', '청천', '벌용', '달동', '화순',
'괴안', '덕치', '일산서', '운연', '광흥창', '동암', '동일', '진도', '하리', '주엽', '상서', '운문', '이화', '웅남', '송포', '곡성', '광교중앙', '만안', '능포',
'군동', '영주', '월등', '후포', '백구', '판부', '봉은사', '남후', '연풍', '시천', '합덕', '여산', '대원', '우성', '북면', '양천향교', '천북', '고삼', '송죽',
'반포', '공릉', '월곡', '구좌', '가정', '시청', '원신', '외남', '덕진', '진봉', '마장', '흥해', '송북', '수암', '백령', '성신여대', '정미', '황학', '대합',
'부산', '당진', '대항', '강촌', '독립문', '불정', '상수', '청계', '행궁', '오리', '홍농', '초전', '인천국제공항', '염산', '동면', '양보', '신암', '경찰병원', '작전',
'서도', '노송', '서귀포', '마산', '창릉', '제원', '문창', '창동', '죽변', '영동', '경안', '골약', '예천', '일봉', '풍천', '광남', '노형', '일죽', '범서',
'총신대', '혜화', '소정', '기배', '고봉', '금왕', '죽항', '고달', '동촌', '재산', '이류', '삼선', '진교', '화서', '작전서운', '청평', '까치울', '춘궁', '녹사평',
'곤제', '양천', '내일', '귤현', '능서', '응암', '계남', '매탄권선', '갈말', '오빈', '신반포', '반월', '계북', '서운', '공주', '결성', '청담', '진잠', '망우',
'개롱', '군서', '회화', '이매', '내이', '달서', '계산', '신전', '인평', '석보', '선산', '강서', '지정', '적중', '양림', '북안', '소주', '동송', '소태', '옴천',
'낭산', '광시', '몽촌토성', '동광', '만석', '남평', '오라', '북문', '대화', '소라', '회남', '진위', '동량', '은행선화', '온산', '취암', '오근장', '영오', '광석',
'장승포', '감곡', '고아', '봉개', '검암', '왕징', '영등포시장', '가경', '안기', '앙성', '진상', '북산', '화도', '과림', '죽산', '고속터미널', '벌교', '소요산',
'봉안', '성안', '구로디지털단지', '마전', '신관', '남태령', '실촌', '겸면', '서상', '세지', '산이', '가금', '성지', '능동', '새절', '온양', '문덕', '공음', '안동',
'복내', '웅천', '소보', '도고', '차황', '방배본', '연신내', '월피', '일광', '송광', '충정로', '고북', '달월', '외서', '검산', '초촌', '송내', '상주', '광평',
'번암', '동해', '물야', '지산', '센트럴파크', '내서', '면천', '구문소', '영등포구청', '무악재', '중곡', '서빙고', '애월', '연평', '함양', '두원', '양주', '상당',
'서둔', '풍세', '용해', '삼승', '흥천', '봉산', '가은', '사봉', '이원', '생림', '본량', '월호', '울진', '전라남', '신설동', '수석', '군산', '영흥', '자월',
'중방', '안국', '문화', '청덕', '신등', '호저', '사리', '서구', '설악', '국제업무지구', '아산', '창전', '함평', '권선', '파장', '대전', '정발산', '포곡', '양성',
'동춘', '정방', '증평출장', '녹양', '문경', '남하', '동이', '광영', '광복', '정촌', '국회의사당', '각북', '미탄', '근남', '상남', '우창', '목포', '신창', '진성',
'부사', '고진', '금촌', '옥봉', '초이', '소이', '내북', '낙동', '생초', '사량', '무거', '광적', '성복', '우곡', '명지대', '박촌', '수안보', '가락시장', '수영',
'잠원', '강천', '원동', '동탄', '영현', '동산', '학온', '충현', '태평', '감삼', '경상남', '경화', '청계산', '공산', '증포', '동오', '금천구청', '춘양', '손양',
'군내', '덕산', '물금', '이천', '은진', '길상', '추자', '약사', '비금', '엄정', '간전', '소사', '장평', '재궁', '분평', '남중', '삼산체육관', '구례', '선주원남',
'덕정', '신당', '벽진', '광명', '호명', '운서', '대산', '상록', '청기', '청암', '전의', '설천', '노곡', '대림', '천호', '부귀', '신대방삼거리', '고려대', '고강본',
'조안', '경마공원', '아라', '고수', '동충', '가례', '학교', '율천', '고남', '압해', '환여', '종합운동장', '강경', '원남', '하망', '지저', '지행', '양포', '등촌',
'인천논현', '천지', '가포', '개군', '종각', '개령', '아시아드경기장', '도덕', '겸백', '학동', '황룡', '화원', '광희', '평동', '화북', '부흥', '장지', '경상북',
'호계', '은산', '양도', '시전', '엄궁', '서산', '잠실나루', '산청', '장충', '응봉', '연지', '함창', '석포', '서탄', '진부', '외속리', '상봉동', '사등', '옥과',
'석성', '주안국가산단', '가천', '청학', '청양', '방어', '방촌', '탑석', '보평', '대양', '홍도', '황간', '서하', '고령', '청구', '도개', '신현', '보성', '검바위',
'이백', '화개', '충청북', '강남대', '음성', '진월', '복정', '구만', '용운', '서부', '논현고잔', '상망', '효령', '구반포', '원대', '보은', '부평시장', '두정', '황산',
'곤지암', '강릉', '용담', '부천시청', '천천', '흑산', '음암', '단촌', '와동', '진산', '효창', '하청', '아포', '매포', '원곡', '북천', '임학', '목면', '신녕',
'도화', '전국', '삼각지', '유등', '금과', '강화', '여주', '달안', '한양대', '동읍', '양북', '장성', '도농', '내동', '을지로', '목동', '부남', '망운', '오남',
'오가', '산동', '북방', '창선', '영양', '성균관대', '탄천', '감문', '율어', '어정', '의당', '신기', '옥구', '일동', '부암', '외대앞', '수신', '집현', '왜관',
'웅양', '사북', '진서', '풍양', '문평', '정남', '구로', '테크노파크', '사당', '기흥', '신태인', '증도', '진안', '오륜', '진북', '버티고개', '단밀', '평택', '서남',
'지좌', '증산', '서홍', '보수', '본리', '산호', '횡성', '상동', '왕곡', '석적', '청운효자', '삼장', '아현', '회룡', '문학경기장', '매산', '구의', '시흥', '논현',
'남촌', '동남', '대평', '국동', '묘도', '오이도', '공항시장', '압구정로데오', '청전', '미조', '금호', '표선', '도남', '하계', '하서', '풍향', '노은', '삼각', '읍부',
'신양', '주상', '부천', '팔달', '우장산', '청통', '조운', '인천대공원', '석봉', '화천', '신서', '춘포', '간성', '신장', '까치산', '대월', '칠원', '북평', '수정',
'경암', '부석', '송암', '중산', '구파발', '인제', '마로', '지품', '서초', '관촌', '김량장', '태화', '회덕', '주포', '부리', '봉수', '동진', '매송', '산내',
'도암', '중동', '다도', '완월', '가야곡', '서강대', '고전', '미원', '만호', '묘량', '군외', '신금호', '종암', '문백', '도곡', '이수', '장흥', '북구', '고덕',
'원삼', '용신', '금암', '삼화', '검암경서', '서울', '당정', '일로', '적성', '갈산', '소양', '금창', '가리봉', '완도', '김유정', '건대', '내장상', '석사', '제주',
'기북', '중원', '염치', '굽은다리', '일산', '천현', '자인', '신포', '삼척', '화남', '풍남', '안의', '남양주', '가능', '용강', '순천', '행당', '구갈', '가야',
'시종', '월드컵경기장', '삼송', '문수', '석남', '법수', '양학', '은현', '수원', '외도', '양수', '동', '서농', '다압', '성내', '인천가좌', '다사', '시초', '오곡',
'성덕', '용남', '돌곶이', '석바위시장', '오정', '초평', '거여', '남일', '은천', '소성', '자금', '제기동', '서서학', '대가', '보령', '상리', '외동', '회진', '학장',
'보문', '면목', '금가', '구미', '사평', '미산', '용당', '정라', '탕정', '의정부중앙', '위도', '정림', '돌산', '조천', '오류동', '생일', '효돈', '무안', '명륜',
'선구', '용두', '남정', '신현원창', '부성', '곡산', '보광', '신도안', '목사동', '삼향', '무장', '광주', '감전', '양천구청', '산척', '수서', '장목', '지평', '하빈',
'송해', '내남', '용흥', '도척', '가재울', '동림', '대마', '향남', '백운', '해운대', '한남', '대구', '성산', '청송', '숭의', '구정', '상일동', '부춘', '대병',
'성거', '녹번', '전대·에버랜드', '자산', '가락본', '대창', '송천', '계림', '둔내', '수산', '계화', '안양', '송악', '매봉', '양남', '공항화물청사', '하장', '백현',
'정안', '내외', '상하', '남산', '하당', '봉강', '임회', '흑석', '송라', '호성', '가양', '봉성', '제철', '북후', '황성', '양재시민의숲', '임동', '삼락', '수민',
'오창', '천곡', '목원', '삼가', '법원', '홍동', '초읍', '봉천', '구산', '계양', '대의', '처인', '경인교대', '임실', '선원', '영등포본', '한대앞', '홍성', '산양',
'동작', '강남', '동백', '현도', '장안', '관고', '안정', '삼죽', '동두천', '도통', '가수원', '봉담', '인동', '전곡', '유구', '쌍문', '가호', '완산', '용암',
'상현', '금릉', '금정', '회기', '대청', '쌍봉', '근흥', '함안', '시기', '송도', '평산', '행신', '팔덕', '서현', '단성', '소수', '임오', '능곡', '종로', '이양',
'웅치', '부곡', '남포', '명정', '합포', '수지', '석문', '동복', '무악', '안내', '운산', '마산합포', '상촌', '사파', '오산대', '의성', '조리', '광도', '보산',
'전주', '감북', '초지', '옹동', '구성', '효곡', '대소', '관평', '갈매', '삼계', '대이', '오전', '모현', '평해', '철마', '도림천', '마곡', '산서', '도봉', '석수',
'안산', '구지', '성건', '파주', '둔전', '만경', '당산', '봉방', '평창', '심천', '망우본', '운봉', '음봉', '달천', '동대문', '인덕원', '광의', '통진', '동안',
'독바위', '삼전', '소원', '양동', '원당', '개운', '용현', '호구포', '청웅', '염포', '사릉', '치평', '옥서', '미아사거리', '달성', '일원본', '야탑', '마천', '신림',
'마들', '뚝섬', '대야미', '마포구청', '삼동', '유천', '천왕', '동강', '태안', '소천', '함라', '원인', '보개', '수성', '가장', '순흥', '신길온천', '효자', '우도',
'목감', '풍기', '개진', '가음정', '연희', '화곡', '명일', '미암', '가창', '만년', '가음', '하대원', '쌍치', '팔금', '둔촌동', '쌍림', '예산', '영원', '고군',
'장남', '진접', '당리', '충화', '삼안', '동묘앞', '고서', '백수', '대사', '서울숲', '상계', '신림본', '삼기', '가곡', '두동', '중문', '해신', '남구', '연천',
'와부', '복흥', '장명', '부발', '남영')
tokenize(nlp, data_, places)
end_time = time.time()
print("모든 프로세스: %f 분" % ((end_time - start_time) / 60))
